MESSAGES = {
    "start": "Привет! Я тебя слушаю. Используйте кнопки ⬇️ для переключения между функциями бота.",
    "no_access": "У вас нет доступа к этому боту.",
    "enter_email_mode": """✉️ Включен режим отправки email. Отправьте:
1️⃣ Первая строка — тема
2️⃣ Вторая строка и далее — текст
📎 Можете прикрепить файлы как отдельными сообщениями, так и вместе с текстом.

Нажмите Меню для управления.""",
    "invalid_format": "Формат сообщения не распознан. Пожалуйста, следуйте инструкции.",
    "exit_email_mode": "📭 Режим отправки email выключен.",
    "not_in_email_mode": "Вы не в режиме отправки email.",
    "email_sent": "✅ Письмо с вложением отправлено.",
    "email_failed": "❌ Не удалось отправить письмо. Попробуйте позже.",
    "ask_recipient": "Введите email получателя. Все письма будут направлены на него.",
    "invalid_email": "Неверный формат email. Повторите попытку.",
    "recipient_saved": "✅ Новый получатель сохранён: {email}",
    "recipient_reset": "🔄 Получатель сброшен. Используется адрес по умолчанию.",
    "current_recipient": "📨 Текущий получатель: <b>{email}</b>"
}
